# NeedsRefresh Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..NeedsRefresh Property
TableSectionData Class See Also
---
Indicates if the table data need to refresh.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool NeedsRefresh { get; set; }
```

Visual Basic
---
```text
Public Property NeedsRefresh As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool NeedsRefresh {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: This operation is forbidden for cells in standard schedule body sections. |

# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace